---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn1
source: html/961e7e96-fb61-5ea9-dc2a-98c8b214dcdb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemBarTypeBackDirn1 Property

"Interior Major Bar Type"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemBarTypeBackDirn1 { get; }
```